<template>
    <div class="agreement">
        <mt-header fixed :title="title" class="header">
            <a @click="back()" slot="left">
            <mt-button icon="back" class="arrow"></mt-button>
            </a>
        </mt-header>
        <div class="content">
        <h1>注册协议</h1>
        <p></p>

<p>为明确本产品用户（以下简称“用户”或“您”）与来购商城（以下简称“本公司”或“我们”或“平台”）之间的权利义务关系，维护双方的合法权益，本着平等互利的原则，双方就本产品服务之相关事宜达成以下协议（下称“本协议”），以资共同遵守。本协议适用于用户注册、使用本公司产品、服务的全部活动，为避免误解，用户成功注册本产品即视为本产品用户，受本协议约束。

在注册成为本产品用户前，请用户务必认真、仔细阅读，并对本协议全部内容作充分理解。用户成功注册或使用本产品，即视为用户已经充分理解和同意本协议全部内容，本协议立即在用户与本公司之间产生法律效力，用户注册使用本产品服务的全部活动将受到本协议的约束并承担相应的责任和义务。如用户不同意本协议内容，请不要注册或使用本产品。

用户须保证在注册或使用本产品时，已经年满18周岁且具备完全民事行为能力。如用户不具备前述条件，用户应终止注册或停止使用本产品。用户若通过本人注册的账户为其他不具备前述条件的任何第三方，本公司有权拒绝提供服务，已提供服务的，本公司有权终止并保留追究责任的权利，因此产生的任何法律责任由用户自行承担。

本协议包括以下所有条款，同时也包括本产品已经发布的或者将来可能发布的各类规则（平台规则）。所有规则均为本协议不可分割的一部分，与本协议具有同等法律效力。

用户在此确认知悉并同意本公司有权根据需要不时修改、增加或删减本协议。本公司将采用在本产品公示的方式通知用户该等修改、增加或删减，用户有义务注意该等公示。一经本产品公示，视为已经通知到用户。用户同意并确认，本公司可能以页面消息、微信、短消息等方式向用户发送将来可能发布的各类规则，该等规则构成本协议的一部分。若用户在本协议及各类规则变更后继续使用本产品服务的，视为用户已仔细认真阅读、充分理解并同意接受修改、增加或删减后的本协议及各类规则，且用户承诺遵守修改、增加或删减后的本协议及各类规则内容，并承担相应的责任和义务。若用户不同意修改、增加或删减后的本协议或各类规则内容，应立即停止使用本产品服务，本公司保留中止、终止或限制用户继续使用本产品服务的权利，但该等终止、中止或限制行为并不豁免用户在本产品已经发生的行为下所应承担的责任和义务。本公司不承担任何因此导致的法律责任。
</p>

<h5>一、账户管理</h5>

<p>1.1. 用户注册本产品时请按照本公司要求准确提供个人信息，并在取得注册账户（下称“该账户”）后及时更新用户准确、最新、完整的身份信息及相关资料，包括不限于手机号码、身份证号码、亲属联系人及社会联系人姓名、职业、银行账户等信息，以便本公司与用户进行及时、有效联系。</p>

<p>1.2. 用户应当使用自身合法的身份信息进行注册，若用户冒用、盗用、拾得他人身份证件办理本公司提供的产品/服务的，用户对此承担所有法律责任；本公司仅对用户的身份信息承担形式审查责任，且仅在自身业务职责范围内承担法律责任。</p>
<p>
1.3. 该账户仅供用户本人使用，用户对使用该账户或密码进行的一切操作及言论负完全的责任。用户须对该账户、密码、身份信息等进行妥善保管，对于因密码、身份信息、校验码等泄露所致的损失由用户自行承担。如用户存在遗失手机或身份证件或银行卡以及其他可能危及本产品账户资金安全或发现有他人冒用或盗用用户的账户登录名及密码或任何其他未经合法授权的情形，应立即以有效方式通知本公司，向本公司申请暂停相关服务。除非另有法律规定或经司法裁判，且征得本公司同意，否则用户不得以任何方式转让、赠与或继承（相关的财产权益除外）其账号及密码等个人信息。
</p>
<p>
1.4. 用户不得通过本人注册的账户为任何第三方，用户充分知悉并承诺，不得以本人的账户出租、出借给他人，且用户充分知悉：若用户以本人账户出租、出借给他人使用，用户仍应承担《注册协议》项下的还款及其他义务。
</p>
<p>
1.5. 若用户有上述违反本协议约定情形的，产生的任何法律责任均由用户承担，本公司对此不承担任何法律责任
</p>
<p>
1.6. 在需要终止使用本产品时，用户可以申请注销本产品账户，用户应当依照本公司规定的程序进行账户注销。本产品账户注销将导致本公司终止为用户提供本产品及相关服务，本协议约定的双方的权利义务终止，但依本协议其他条款另行约定不得终止的或依其性质不能终止的除外。
</p>
<p>
1.7. 存在以下情形的，本公司有权拒绝用户注销账户的申请并应将拒绝理由告知用户：1.该账户尚存在未了结的权利义务关系；2.注销该账户会损害本公司、本公司用户或他人的合法权益；3.本公司认为不适宜注销该账户的其他情形。
</p>
<p>
<h5>
二、使用限制
</h5>


<p>
5.1. 用户在使用本产品时应遵守中华人民共和国相关法律法规、用户所在国家或地区之法令及相关国际惯例，不将本产品用于任何非法目的，也不以任何非法方式使用本产品，否则本公司有权拒绝提供服务，或提前终止协议，且用户应承担所有相关法律责任。
</p>
<p>
5.2. 用户不得利用本产品从事侵害他人合法权益之行为，否则本公司有权拒绝提供本产品，或提前终止协议，且用户应承担所有相关法律责任，因此导致本公司或本公司雇员或其他方受损的，用户应承担赔偿责任。上述行为包括但不限于:
</p>
<p>
1）侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。
</p>
<p>
2）违反依法定或约定之保密义务。
</p>
<p>
3）冒用他人名义使用本产品。
</p>
<p>
4）从事不法交易行为。
</p>
<p>
5）未按时履行还款义务。
</p>
<p>
6）提供骗贷资讯或以任何方式引诱他人参与骗贷。
</p>
<p>
7）非法使用他人银行账户或无效银行账户交易。
</p>
<p>
8）从事任何可能含有电脑病毒或是可能侵害本产品系统、资料之行为。
</p>
<p>
9）其他本公司有正当理由认为不适当之行为。
</p>
<p>
5.3 用户理解并同意，本公司不对因下述任一情况导致的任何损害赔偿承担责任:
</p>
<p>
1）本公司有权基于单方判断，包含但不限于本公司认为用户已经违反本协议的明文规定及精神，对用户的名下的全部或部分产品账户暂停、中断或终止向用户提供本产品或其任何部分，并移除或公布用户的资料。
</p>
<p>
2）本公司在发现异常交易或合理怀疑交易有疑义或有违反法律规定或本协议约定之虞时，有权不经通知先行暂停或终止用户产品账户的使用（包括但不限于对账户名下的信用评分和在途交易采取取消交易等限制措施），并拒绝用户使用本产品之部分或全部功能。
</p>
<p>
3）用户理解并同意，存在如下情形时，本公司有权对用户注册账号或交易进行冻结或追回，且有权限制用户所使用的产品或服务的部分或全部功能：
</p>
<p>
a．根据本协议的约定。
</p>
<p>
b．根据法律法规及法律文书的规定。
</p>
<p>
c．根据有权机关的要求。
</p>
<p>
d．用户使用本产品服务的行为涉嫌违反国家法律法规及行政规定的。
</p>
<p>
e．本公司基于单方面合理判断认为账户信息、操作等存在异常时。
</p>
<p>
f．本公司依据自行合理判断认为可能产生风险的。
</p>
<p>
g．用户批量注册、提供虚假信息或材料及其他舞弊等违反使用规则、违反诚实信用原则的。
</p>
<p>
h．错误汇入资金等导致用户可能存在不当得利的。
</p>
<p>
i．用户未按时履行还款义务的。
</p>
<p>
j．用户损害他人利益，且对方已经提供了一定证据的。
</p>
<p>
5.4. 如用户申请解除上述冻结或限制，用户应按本公司要求如实提供相关资料及用户的身份证明以及本公司要求的其他信息或文件，以便本公司进行核实，且本公司有权依照自行判断来决定是否同意用户的申请。
</p>
<p>
    <h5>
六、隐私权保护
    </h5>

<p>
本公司重视对用户隐私的保护。仅限于向用户提供服务及提升服务质量的目的和以下情形，本公司收集或使用用户的个人信息：
</p>
<p>
6.1. 获得用户的同意或授权。
</p>
<p>
6.2. 某些情况下，只有共享用户的信息，才能提供用户需要的服务和（或）产品，或处理用户与他人的交易纠纷或争议。
</p>
<p>
6.3. 某些服务和（或）产品由本公司的合作伙伴提供或由本公司与合作伙伴共同提供，本公司会与其共享提供服务和（或）产品需要的信息，且在此情形下，本公司需要求该等合作伙伴承担相应的保密义务。
</p>
<p>
6.4. 根据法律法规的规定及有权机关的要求。
</p>
<p>
6.5. 为维护本公司、用户及其他用户的合法权益。
</p>
<p>
6.6 根据法律规定及合理商业习惯，在本公司计划与其他公司合并或被其收购或进行其他资本市场活动（包括但不限于IPO，债券发行）时，以及其他情形下本公司需要接受来自其他主体的尽职调查时，本公司会把用户的信息提供给必要的主体，但本公司会通过和这些主体签署保密协议等方式要求其对用户的个人信息采取合理的保密措施。
</p>
<p>
<h5>
三、平台中断或故障
</h5>
<p>
8.1. 用户理解并同意，在使用本产品的过程中，可能会遇到不可抗力等风险因素，使本产品服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时本公司将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户造成的损失本公司在法律允许的范围内免责。
</p>
<p>
8.2 在法律允许的范围内，本公司对以下情形导致的服务中断或受阻不承担责任：
</p>
<p>
（1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
</p>
<p>
（2）用户或本公司的电脑软件、系统、硬件和通信线路出现故障；
</p>
<p>
（3）用户操作不当；
</p>
<p>
（4）用户通过非本公司授权的方式使用本服务；
</p>
<p>
（5）其他本公司无法控制或合理预见的情形。
</p>
<p>
四、 责任范围及责任限制
</p>
<p>
9.1. 本公司仅对本协议中列明的责任承担范围负责。
</p>
<p>
9.2. 本公司用户信息是由用户本人自行提供的，本公司无法保证该信息之准确、及时和完整。
</p>
<p>
9.3. 本公司不对信用评估及本产品提供任何形式的保证。
</p>
<p>
五、商标、知识产权、专利的保护
</p>
<p>
10.1. 本公司及关联公司所有平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由本公司或本公司关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
</p>
<p>
10.2. 非经本公司或本公司关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。
</p>
<p>
10.3. 尊重知识产权是用户应尽的义务，如有违反，用户应承担损害赔偿责任。
</p>
<p>
六、法律适用与管辖
</p>
<p>
本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律， 没有相关法律规定的，参照通用国际商业惯例和（或）行业惯例。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由本公司所在地的人民法院管辖。
</p>
</div>
    </div>
</template>
<script>
export default {
    name:"agreement",
    data(){
        return {
            title:"注册协议"
        }
    },
    methods:{
        back(){
            this.$router.go(-1);
        }
    }
}
</script>
<style scoped>
    .header{
       height:1rem;
       font-size: .4rem;
       line-height:1rem;
       background-color: #5B89FF;
    }
    .agreement{
        height:100vh;
        font-family: "微软雅黑";
    }
    .content{
        margin-top:1rem;
        line-height: .3rem;
        box-sizing:border-box;
        padding:.2rem;
    }
    h1{
        margin: 0 auto;
        font-size: .4rem;
        text-align: center;
    }
    h5{
        font-size: .3rem;
        font-weight: normal;
        margin:.1rem;
    }
    p{
        font-size:.2rem;
        text-indent: .4rem;
    }
</style>
